cask_args appdir: "~/Applications"

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "mongodb/brew"

brew "bat"
brew "git-delta"
brew "go"
brew "mas"
brew "mongodb/brew/mongodb-community"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "ripgrep"
brew "tldr"
brew "tldr"
brew "tmux"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

cask "discord"
cask "dropbox"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "libreoffice"
cask "linear-linear"
cask "mysqlworkbench"
cask "notion"
cask "numi"
cask "rectangle"
cask "visual-studio-code"
cask "zoom"

mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "Grammarly for Safari", id: 1462114288
mas "Photos Duplicate Cleaner", id: 592704001
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
