cask_args appdir: "~/Applications"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

brew "bat"
brew "glib"
brew "clisp"
brew "fd"
brew "git"
brew "git-delta"
brew "go"
brew "harfbuzz"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "lua"
brew "mas"
brew "mysql"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "ripgrep"
brew "sbcl"
brew "tldr"
brew "tmux"
brew "tree"
brew "watchman"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus@27"
brew "mongodb/brew/mongodb-community"

cask "alacritty"
cask "calibre"
cask "chromedriver"
cask "discord"
cask "disk-drill"
cask "dropbox"
cask "epic-games"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "keka"
cask "libreoffice"
cask "linear-linear"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mochi"
cask "mysqlworkbench"
cask "notion"
cask "numi"
cask "obsidian"
cask "openemu"
cask "postman"
cask "rectangle"
cask "selfcontrol"
cask "spotify"
cask "stats"
cask "steam"
cask "temurin"
cask "transmission"
cask "ultdata"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "Flow", id: 1423210932
mas "Grammarly for Safari", id: 1462114288
mas "Meeter", id: 1510445899
mas "Photos Duplicate Cleaner", id: 592704001
mas "Smart Countdown Timer", id: 1410709951
mas "Vimari", id: 1480933944
